lee35210/nRF52840_BLE_FREERTOS_TCS34725/main.c
        persistence.reg_addr=TCS34725_REG_PERSISTENCE;
        tcs34725_read_reg(&tcs34725_instance, &persistence, tcs34725_read_reg_cb);
        vTaskDelay(10);
        
        config.reg_addr=TCS34725_REG_CONFIG;
        tcs34725_read_reg(&tcs34725_instance, &config, tcs34725_read_reg_cb);
        vTaskDelay(10);
        
        control.reg_addr=TCS34725_REG_CONTROL;
        tcs34725_read_reg(&tcs34725_instance, &control, tcs34725_read_reg_cb);
        vTaskDelay(10);
        
        id.reg_addr=TCS34725_REG_ID;
        tcs34725_read_reg(&tcs34725_instance, &id, tcs34725_read_reg_cb);
        vTaskDelay(10);
        
        status.reg_addr=TCS34725_REG_STATUS;
        tcs34725_read_reg(&tcs34725_instance, &status, tcs34725_read_reg_cb);
        vTaskDelay(10);

        
        vTaskDelete(m_tcs_reg_all_send_thread);
    }
}

void tcs34725_cmd_func(char *str_cmd, char *str_data)
{
    tcs34725_reg_data_t tcs_cmd_str;
    ret_code_t err_code;

    if(strcmp(str_cmd,"RAR")==0)
    {
        if(pdPASS!=xTaskCreate(tcs_read_all_reg_thread, "TCS_READ_ALL_REG", configMINIMAL_STACK_SIZE+30,
                       NULL, 3, &m_tcs_reg_all_send_thread))
        {
            APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
        }
    }
    else if(strcmp(str_cmd,"TIM")==0)
    {
        NRF_LOG_INFO("Set Timming");
        err_code=tcs34725_set_timing(&tcs34725_instance,chartoint(str_data));
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Set timing fail");
            return;
        }
        tcs_cmd_str.reg_addr=TCS34725_REG_TIMING;
        err_code=tcs34725_read_reg(&tcs34725_instance,&tcs_cmd_str,tcs34725_read_reg_cb);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Read timing fail");
            return;
        }
    }
    else if(strcmp(str_cmd,"WAT")==0)
    {
        NRF_LOG_INFO("Set Wait Time");
        err_code=tcs34725_set_wait_time(&tcs34725_instance,chartoint(str_data));
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Set wait time fail");
            return;
        }
        tcs_cmd_str.reg_addr=TCS34725_REG_WAIT_TIME;
        err_code=tcs34725_read_reg(&tcs34725_instance,&tcs_cmd_str,tcs34725_read_reg_cb);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Read wait time fail");
            return;
        }
    }
    else if(strcmp(str_cmd,"GIN")==0)
    {
        NRF_LOG_INFO("Set gain");
        err_code=tcs34725_set_gain(&tcs34725_instance,chartoint(str_data));
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Set gain fail");
            return;
        }
        tcs_cmd_str.reg_addr=TCS34725_REG_CONTROL;
        err_code=tcs34725_read_reg(&tcs34725_instance,&tcs_cmd_str,tcs34725_read_reg_cb);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Read gain fail");
            return;
        }
    }
    else if(strcmp(str_cmd,"ENA")==0)
    {
        NRF_LOG_INFO("Set interrupt");
        err_code=tcs34725_set_interrupt(&tcs34725_instance,chartoint(str_data));
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Set interrupt fail");
            return;
        }
        tcs_cmd_str.reg_addr=TCS34725_REG_ENABLE;
        err_code=tcs34725_read_reg(&tcs34725_instance,&tcs_cmd_str,tcs34725_read_reg_cb);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Read interrupt fail");
            return;
        }
    }
    else if(strcmp(str_cmd,"WLO")==0)
    {
        NRF_LOG_INFO("Set wait long");
        err_code=tcs34725_set_wait_long(&tcs34725_instance,chartoint(str_data));
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Set wait long fail");
            return;
        }
        tcs_cmd_str.reg_addr=TCS34725_REG_CONFIG;
        err_code=tcs34725_read_reg(&tcs34725_instance,&tcs_cmd_str,tcs34725_read_reg_cb);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Read wait long fail");
            return;
        }
    }
    else
    {
    }
}

static void tcs_wr_reg_thread(void *arg)
{
    while(1)
    {
        if(ulTaskNotifyTake(pdTRUE,10)!=0)
        {
        }
        vTaskDelay(1000);
    }
}

static void led_toggle_thread(void * pvParameter)
{
    configSTACK_DEPTH_TYPE uxHighWaterMark2;
    uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);

    UNUSED_PARAMETER(pvParameter);
    while (true)
    {
        bsp_board_led_invert(BSP_BOARD_LED_0);
        vTaskDelay(1000);
        uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
//        printf("LED : %d\r\n",uxHighWaterMark2);
    }
}

static void tcs_read_rgbc_thread(void *arg)
{
    tcs34725_rgbc_data_t tcs_rgbc_thread;
    while(1)
    {
        tcs34725_read_rgbc(&tcs34725_instance,&tcs_rgbc_thread,tcs34725_rgbc_cb);
        vTaskDelay(5000);
    }
}

static void ble_tcs_rgbc_send_thread(void *arg)
{
    ret_code_t err_code;
    tcs34725_rgbc_data_t ble_tcs_send_rgb;
    char data_array[18]={};
    uint16_t length=sizeof(data_array);

    configSTACK_DEPTH_TYPE uxHighWaterMark2;
    uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);

    while(1)
    {
        if(ulTaskNotifyTake(pdTRUE,10)!=0)
        {
            if(pdPASS!=xQueueReceive(m_tcs_rgb_data_queue, &ble_tcs_send_rgb, 10))
            {
                //fail
            }

            sprintf(data_array,"RGB%5d%3d%3d%3d",ble_tcs_send_rgb.clear,ble_tcs_send_rgb.red,ble_tcs_send_rgb.green,
                    ble_tcs_send_rgb.blue);
            if(m_conn_handle!=BLE_CONN_HANDLE_INVALID)
            {
                err_code=ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
                if ((err_code != NRF_ERROR_INVALID_STATE) &&
                    (err_code != NRF_ERROR_RESOURCES) &&
                    (err_code != NRF_ERROR_NOT_FOUND))
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
//            uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
//            printf("BLE UART : %d\r\n",uxHighWaterMark2);
        }
    }
}

